backend/app/controllers/tasks_controller.rb

  def create

    create_params = {
      title: params[:title], # Convert title to uppercase
      description: params[:description] || "No description provided", # Default description
      completed: params[:completed] || false # Default completed to false
    }

    # render json: { received_params: create_params[:description] }, status: :ok

    @task = Task.new(create_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "description", "completed", "created_at", "updated_at") VALUES ('rails api', 'develope create task api in ruby on rails', FALSE, '2025-02-09 10:11:48.442372', '2025-02-09 10:11:48.442372') RETURNING "id"

  def updateStatus

    @task = Task.find(params[:id])

    update_params = {
      title: params[:title] ,
      description: params[:description],
      completed: params[:completed] || false # Default completed to false
    }

    if @task
      if @task.update(update_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 5 LIMIT 1
UPDATE "tasks" SET "title" = 'rails api 1', "updated_at" = '2025-02-09 13:01:01.365067' WHERE "tasks"."id" = 5

  def delete
    @task = Task.find(params[:id])

    if @task
      @task.destroy!
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 7 LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = 7